In [32]:
import pandas as pd
import seaborn as sns

In [33]:
data=pd.read_csv("Salary_Dataset_with_Extra_Features.csv")

In [34]:
data.head()

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,Sasken,Android Developer,400000,3,Bangalore,Full Time,Android
1,4.5,Advanced Millennium Technologies,Android Developer,400000,3,Bangalore,Full Time,Android
2,4.0,Unacademy,Android Developer,1000000,3,Bangalore,Full Time,Android
3,3.8,SnapBizz Cloudtech,Android Developer,300000,3,Bangalore,Full Time,Android
4,4.4,Appoids Tech Solutions,Android Developer,600000,3,Bangalore,Full Time,Android

In [35]:
data.isna().sum()

Rating               0
Company Name         0
Job Title            0
Salary               0
Salaries Reported    0
Location             0
Employment Status    0
Job Roles            0
dtype: int64

In [36]:
data.nunique()

Rating                  41
Company Name         11261
Job Title             1080
Salary                 316
Salaries Reported       82
Location                10
Employment Status        4
Job Roles               11
dtype: int64

In [37]:
from sklearn.preprocessing import LabelEncoder

In [38]:
le0=LabelEncoder()
data["Company Name"]=le0.fit_transform(data["Company Name"])
data.head()

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,8130,Android Developer,400000,3,Bangalore,Full Time,Android
1,4.5,417,Android Developer,400000,3,Bangalore,Full Time,Android
2,4.0,9778,Android Developer,1000000,3,Bangalore,Full Time,Android
3,3.8,8534,Android Developer,300000,3,Bangalore,Full Time,Android
4,4.4,884,Android Developer,600000,3,Bangalore,Full Time,Android

In [39]:
le1=LabelEncoder()
data["Job Title"]=le1.fit_transform(data["Job Title"])
data.head()

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,8130,28,400000,3,Bangalore,Full Time,Android
1,4.5,417,28,400000,3,Bangalore,Full Time,Android
2,4.0,9778,28,1000000,3,Bangalore,Full Time,Android
3,3.8,8534,28,300000,3,Bangalore,Full Time,Android
4,4.4,884,28,600000,3,Bangalore,Full Time,Android

In [40]:
le2=LabelEncoder()
data["Employment Status"]=le2.fit_transform(data["Employment Status"])
data.head()

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,8130,28,400000,3,Bangalore,1,Android
1,4.5,417,28,400000,3,Bangalore,1,Android
2,4.0,9778,28,1000000,3,Bangalore,1,Android
3,3.8,8534,28,300000,3,Bangalore,1,Android
4,4.4,884,28,600000,3,Bangalore,1,Android

In [41]:
le3=LabelEncoder()
data["Location"]=le3.fit_transform(data["Location"])
data.head()

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,8130,28,400000,3,0,1,Android
1,4.5,417,28,400000,3,0,1,Android
2,4.0,9778,28,1000000,3,0,1,Android
3,3.8,8534,28,300000,3,0,1,Android
4,4.4,884,28,600000,3,0,1,Android

In [42]:
le4=LabelEncoder()
data["Job Roles"]=le4.fit_transform(data["Job Roles"])
data.head()

,Rating,Company Name,Job Title,Salary,Salaries Reported,Location,Employment Status,Job Roles
0,3.8,8130,28,400000,3,0,1,0
1,4.5,417,28,400000,3,0,1,0
2,4.0,9778,28,1000000,3,0,1,0
3,3.8,8534,28,300000,3,0,1,0
4,4.4,884,28,600000,3,0,1,0